answers = [
  # Положительные
  "Бесспорно",
  "Предрешено",
  "Никаких сомнений",
  "Определённо да",
  "Можешь быть уверен в этом",

  # Нерешительно положительные
  "Мне кажется — «да»",
  "Вероятнее всего",
  "Хорошие перспективы",
  "Знаки говорят — «да»",
  "Да",

  # Нейтральные
  "Пока не ясно, попробуй снова",
  "Спроси позже",
  "Лучше не рассказывать",
  "Сейчас нельзя предсказать",
  "Сконцентрируйся и спроси опять",

  # Отрицательные
  "Даже не думай",
  "Мой ответ — «нет»",
  "По моим данным — «нет»",
  "Перспективы не очень хорошие",
  "Весьма сомнительно"
]

greetings = [
"Привет, дорогой друг! Задавай свой вопрос...",
"Здравствуйте! Готов ответить на Ваш вопрос...",
"Привет, искатель истины! Ответ на твой вопрос...",
"Hi-йствуйте! Безмерно рад...",\
"Опять ты!...",
"И снова здравствуйте! Ваш вопрос?...",
"Пора уже начать брать деньги за жизненные консультации..."
]

puts greetings.sample
puts
sleep 5
puts answers.sample
